nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_AD_06 (coord N13), IA1_ADC1_A0 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IA1_ADC1_A0_PERIPHERAL                          LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IA1_ADC1_A0_SIGNAL                                   A   /*!< Signal name */
#define BOARD_INITADCPINS_IA1_ADC1_A0_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_AD_08 (coord R15), IA2_ADC1_A1 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IA2_ADC1_A1_PERIPHERAL                          LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IA2_ADC1_A1_SIGNAL                                   A   /*!< Signal name */
#define BOARD_INITADCPINS_IA2_ADC1_A1_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_AD_10 (coord R17), IA3_ADC1_A2 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IA3_ADC1_A2_PERIPHERAL                          LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IA3_ADC1_A2_SIGNAL                                   A   /*!< Signal name */
#define BOARD_INITADCPINS_IA3_ADC1_A2_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_AD_14 (coord N14), IC2_ADC1_A4 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IC2_ADC12_A4_PERIPHERAL                         LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IC2_ADC12_A4_SIGNAL                                  A   /*!< Signal name */
#define BOARD_INITADCPINS_IC2_ADC12_A4_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_AD_16 (coord N17), IC3_ADC1_A5 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IC3_ADC12_A5_PERIPHERAL                         LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IC3_ADC12_A5_SIGNAL                                  A   /*!< Signal name */
#define BOARD_INITADCPINS_IC3_ADC12_A5_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_AD_07 (coord T17), IA4_ADC1_B0 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IA4_ADC1_B0_PERIPHERAL                          LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IA4_ADC1_B0_SIGNAL                                   B   /*!< Signal name */
#define BOARD_INITADCPINS_IA4_ADC1_B0_CHANNEL                                 1U   /*!< Signal channel */

/* GPIO_AD_09 (coord R16), IDC1_ADC1_B1 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IDC1_ADC1_B1_PERIPHERAL                         LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IDC1_ADC1_B1_SIGNAL                                  B   /*!< Signal name */
#define BOARD_INITADCPINS_IDC1_ADC1_B1_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_AD_11 (coord P16), IDC2_ADC1_B2 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IDC2_ADC1_B2_PERIPHERAL                         LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IDC2_ADC1_B2_SIGNAL                                  B   /*!< Signal name */
#define BOARD_INITADCPINS_IDC2_ADC1_B2_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_AD_13 (coord L12), IC4_ADC1_B3 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IC4_ADC12_B3_PERIPHERAL                         LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_IC4_ADC12_B3_SIGNAL                                  B   /*!< Signal name */
#define BOARD_INITADCPINS_IC4_ADC12_B3_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_AD_15 (coord M14), VDC1_ADC1_B4 */
/* Routed pin properties */
#define BOARD_INITADCPINS_VDC1_ADC12_B4_PERIPHERAL                        LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_VDC1_ADC12_B4_SIGNAL                                 B   /*!< Signal name */
#define BOARD_INITADCPINS_VDC1_ADC12_B4_CHANNEL                               1U   /*!< Signal channel */

/* GPIO_AD_17 (coord N15), VDC2_ADC1_B5 */
/* Routed pin properties */
#define BOARD_INITADCPINS_VDC2_ADC12_B5_PERIPHERAL                        LPADC1   /*!< Peripheral name */
#define BOARD_INITADCPINS_VDC2_ADC12_B5_SIGNAL                                 B   /*!< Signal name */
#define BOARD_INITADCPINS_VDC2_ADC12_B5_CHANNEL                               1U   /*!< Signal channel */

/* GPIO_AD_18 (coord M16), IB1_ADC2_A0 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IB1_ADC2_A0_PERIPHERAL                          LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IB1_ADC2_A0_SIGNAL                                   A   /*!< Signal name */
#define BOARD_INITADCPINS_IB1_ADC2_A0_CHANNEL                                 2U   /*!< Signal channel */

/* GPIO_AD_20 (coord K13), IB2_ADC2_A1 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IB2_ADC2_A1_PERIPHERAL                          LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IB2_ADC2_A1_SIGNAL                                   A   /*!< Signal name */
#define BOARD_INITADCPINS_IB2_ADC2_A1_CHANNEL                                 2U   /*!< Signal channel */

/* GPIO_AD_22 (coord K12), IB3_ADC2_A2 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IB3_ADC2_A2_PERIPHERAL                          LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IB3_ADC2_A2_SIGNAL                                   A   /*!< Signal name */
#define BOARD_INITADCPINS_IB3_ADC2_A2_CHANNEL                                 2U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), IC1_ADC1_A3 */
/* Routed pin properties */
#define BOARD_INITADCPINS_IC1_ADC12_A3_PERIPHERAL                         LPADC2   /*!< Peripheral name */
#define BOARD_INITADCPINS_IC1_ADC12_A3_SIGNAL                                  A   /*!< Signal name */
#define BOARD_INITADCPINS_IC1_ADC12_A3_CHANNEL                                2U   /*!< Signal channel */

