nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* GPIO_EMC_B1_31 (coord D2), PWM3_A1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM3_A1_PERIPHERAL                                PWM3   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM3_A1_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM3_A1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_33 (coord E2), PWM3_A2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM3_A2_PERIPHERAL                                PWM3   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM3_A2_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM3_A2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_30 (coord E3), PWM3_B0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM3_B0_PERIPHERAL                                PWM3   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM3_B0_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM3_B0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_32 (coord D1), PWM3_B1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM3_B1_PERIPHERAL                                PWM3   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM3_B1_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM3_B1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_34 (coord E1), PWM3_B2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM3_B2_PERIPHERAL                                PWM3   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM3_B2_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM3_B2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_00 (coord F3), PWM4_A0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM4_A0_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM4_A0_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM4_A0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord G4), PWM4_A1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM4_A1_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM4_A1_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM4_A1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_04 (coord H5), PWM4_A2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM4_A2_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM4_A2_SIGNAL                                       A   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM4_A2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord F2), PWM4_B0 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM4_B0_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM4_B0_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM4_B0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord E4), PWM4_B1 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM4_B1_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM4_B1_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM4_B1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_05 (coord F4), PWM4_B2 */
/* Routed pin properties */
#define BOARD_INITPWMPINS_PWM4_B2_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWMPINS_PWM4_B2_SIGNAL                                       B   /*!< Signal name */
#define BOARD_INITPWMPINS_PWM4_B2_CHANNEL                                     2U   /*!< Signal channel */

/*!
 * @brief Configures PWM pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPwmPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B2_06 (coord T1), PWM1_FAULT */
/* Routed pin properties */
#define BOARD_INITPWMFAULTPINS_PWM1_FAULT_PERIPHERAL                        PWM1   /*!< Peripheral name */
#define BOARD_INITPWMFAULTPINS_PWM1_FAULT_SIGNAL                           FAULT   /*!< Signal name */
#define BOARD_INITPWMFAULTPINS_PWM1_FAULT_CHANNEL                             0U   /*!< Signal channel */

/* GPIO_EMC_B2_07 (coord M3), PWM2_FAULT */
/* Routed pin properties */
#define BOARD_INITPWMFAULTPINS_PWM2_FAULT_PERIPHERAL                        PWM2   /*!< Peripheral name */
#define BOARD_INITPWMFAULTPINS_PWM2_FAULT_SIGNAL                           FAULT   /*!< Signal name */
#define BOARD_INITPWMFAULTPINS_PWM2_FAULT_CHANNEL                             0U   /*!< Signal channel */

/* GPIO_EMC_B2_08 (coord P1), PWM3_FAULT */
/* Routed pin properties */
#define BOARD_INITPWMFAULTPINS_PWM3_FAULT_PERIPHERAL                        PWM3   /*!< Peripheral name */
#define BOARD_INITPWMFAULTPINS_PWM3_FAULT_SIGNAL                           FAULT   /*!< Signal name */
#define BOARD_INITPWMFAULTPINS_PWM3_FAULT_CHANNEL                             0U   /*!< Signal channel */

/* GPIO_EMC_B2_09 (coord N2), PWM4_FAULT */
/* Routed pin properties */
#define BOARD_INITPWMFAULTPINS_PWM4_FAULT_PERIPHERAL                        PWM4   /*!< Peripheral name */
#define BOARD_INITPWMFAULTPINS_PWM4_FAULT_SIGNAL                           FAULT   /*!< Signal name */
#define BOARD_INITPWMFAULTPINS_PWM4_FAULT_CHANNEL                             0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPwmFaultPins(void);            /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B2_00 (coord K2), ENC1_I */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC1_I_ABS_ENC_SYNC_PERIPHERAL                    ENC1   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC1_I_ABS_ENC_SYNC_SIGNAL                       INDEX   /*!< Signal name */

