nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* GPIO_EMC_B2_01 (coord K4), ENC1_A */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC1_A_PERIPHERAL                                 ENC1   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC1_A_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC1_A_CHANNEL                                       A   /*!< Signal channel */

/* GPIO_EMC_B2_02 (coord K3), ENC1_B */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC1_B_PERIPHERAL                                 ENC1   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC1_B_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC1_B_CHANNEL                                       B   /*!< Signal channel */

/* GPIO_EMC_B2_03 (coord R1), ENC2_I */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC2_I_ABS_ENC_SYNC_PERIPHERAL                    ENC2   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC2_I_ABS_ENC_SYNC_SIGNAL                       INDEX   /*!< Signal name */

/* GPIO_EMC_B2_04 (coord M1), ENC2_A */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC2_A_PERIPHERAL                                 ENC2   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC2_A_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC2_A_CHANNEL                                       A   /*!< Signal channel */

/* GPIO_EMC_B2_05 (coord N1), ENC2_B */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC2_B_PERIPHERAL                                 ENC2   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC2_B_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC2_B_CHANNEL                                       B   /*!< Signal channel */

/* GPIO_EMC_B1_12 (coord C5), ENC3_I */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC3_I_ABS_ENC_SYNC_PERIPHERAL                    ENC3   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC3_I_ABS_ENC_SYNC_SIGNAL                       INDEX   /*!< Signal name */

/* GPIO_EMC_B1_13 (coord D5), ENC3_A */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC3_A_PERIPHERAL                                 ENC3   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC3_A_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC3_A_CHANNEL                                       A   /*!< Signal channel */

/* GPIO_EMC_B1_14 (coord B1), ENC3_B */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC3_B_PERIPHERAL                                 ENC3   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC3_B_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC3_B_CHANNEL                                       B   /*!< Signal channel */

/* GPIO_EMC_B1_35 (coord F1), ENC4_I */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC4_I_ABS_ENC_SYNC_PERIPHERAL                    ENC4   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC4_I_ABS_ENC_SYNC_SIGNAL                       INDEX   /*!< Signal name */

/* GPIO_EMC_B1_36 (coord G1), ENC4_A */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC4_A_PERIPHERAL                                 ENC4   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC4_A_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC4_A_CHANNEL                                       A   /*!< Signal channel */

/* GPIO_EMC_B1_37 (coord H1), ENC4_B */
/* Routed pin properties */
#define BOARD_INITENCPINS_ENC4_B_PERIPHERAL                                 ENC4   /*!< Peripheral name */
#define BOARD_INITENCPINS_ENC4_B_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITENCPINS_ENC4_B_CHANNEL                                       B   /*!< Signal channel */

/*!
 * @brief Configures ENC pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEncPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_15 (coord C1), SPI1_SCK_FXIO1_D15 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_SCK_FXIO1_D15_PERIPHERAL       FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_SCK_FXIO1_D15_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_SCK_FXIO1_D15_CHANNEL              15U   /*!< Signal channel */

/* GPIO_EMC_B1_16 (coord D3), SPI1_CS_FXIO1_D16 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_CS_FXIO1_D16_PERIPHERAL        FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_CS_FXIO1_D16_SIGNAL                 IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_CS_FXIO1_D16_CHANNEL               16U   /*!< Signal channel */

/* GPIO_EMC_B1_17 (coord B3), SPI1_MISO_FXIO1_D17 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_MISO_FXIO1_D17_PERIPHERAL      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_MISO_FXIO1_D17_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_MISO_FXIO1_D17_CHANNEL             17U   /*!< Signal channel */

/* GPIO_EMC_B1_18 (coord B4), SPI1_MOSI_FXIO1_D18 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_MOSI_FXIO1_D18_PERIPHERAL      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_MOSI_FXIO1_D18_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI1_MOSI_FXIO1_D18_CHANNEL             18U   /*!< Signal channel */

/* GPIO_EMC_B1_19 (coord C4), SPI2_SCK_FXIO1_D19 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_SCK_FXIO1_D19_PERIPHERAL       FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_SCK_FXIO1_D19_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_SCK_FXIO1_D19_CHANNEL              19U   /*!< Signal channel */

/* GPIO_EMC_B1_20 (coord C3), SPI2_CS_FXIO1_D20 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_CS_FXIO1_D20_PERIPHERAL        FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_CS_FXIO1_D20_SIGNAL                 IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_CS_FXIO1_D20_CHANNEL               20U   /*!< Signal channel */

