nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* GPIO_EMC_B1_21 (coord G2), SPI2_MISO_FXIO1_D21 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MISO_FXIO1_D21_PERIPHERAL      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MISO_FXIO1_D21_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MISO_FXIO1_D21_CHANNEL             21U   /*!< Signal channel */

/* GPIO_EMC_B1_22 (coord H2), SPI2_MOSI_FXIO1_D22 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MOSI_FXIO1_D22_PERIPHERAL      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MOSI_FXIO1_D22_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI2_MOSI_FXIO1_D22_CHANNEL             22U   /*!< Signal channel */

/* GPIO_AD_04 (coord M13), SPI3_SCK_FXIO2_D04 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_SCK_FXIO2_D04_PERIPHERAL       FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_SCK_FXIO2_D04_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_SCK_FXIO2_D04_CHANNEL               4U   /*!< Signal channel */

/* GPIO_AD_05 (coord P13), SPI3_CS_FXIO2_D05 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_CS_FXIO2_D05_PERIPHERAL        FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_CS_FXIO2_D05_SIGNAL                 IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_CS_FXIO2_D05_CHANNEL                5U   /*!< Signal channel */

/* GPIO_AD_26 (coord L14), SPI3_MISO_FXIO2_D26 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MISO_FXIO2_D26_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MISO_FXIO2_D26_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MISO_FXIO2_D26_CHANNEL             26U   /*!< Signal channel */

/* GPIO_AD_27 (coord N16), SPI3_MOSI_FXIO2_D27 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MOSI_FXIO2_D27_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MOSI_FXIO2_D27_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI3_MOSI_FXIO2_D27_CHANNEL             27U   /*!< Signal channel */

/* GPIO_AD_28 (coord L17), SPI4_SCK_FXIO2_D28 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_SCK_FXIO2_D28_PERIPHERAL       FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_SCK_FXIO2_D28_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_SCK_FXIO2_D28_CHANNEL              28U   /*!< Signal channel */

/* GPIO_AD_29 (coord M17), SPI4_CS_FXIO2_D29 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_CS_FXIO2_D29_PERIPHERAL        FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_CS_FXIO2_D29_SIGNAL                 IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_CS_FXIO2_D29_CHANNEL               29U   /*!< Signal channel */

/* GPIO_AD_30 (coord K17), SPI4_MISO_FXIO2_D30 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MISO_FXIO2_D30_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MISO_FXIO2_D30_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MISO_FXIO2_D30_CHANNEL             30U   /*!< Signal channel */

/* GPIO_AD_31 (coord J17), SPI4_MOSI_FXIO2_D31 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MOSI_FXIO2_D31_PERIPHERAL      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MOSI_FXIO2_D31_SIGNAL               IO   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI4_MOSI_FXIO2_D31_CHANNEL             31U   /*!< Signal channel */

/* GPIO_LPSR_10 (coord R5), SPI_CS_SEL0 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_PERIPHERAL      GPIO12   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_SIGNAL         gpio_io   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_CHANNEL            10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_GPIO            GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_GPIO_PIN           10U   /*!< GPIO pin number */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL0_I2C6_SDA_GPIO_PIN_MASK (1U << 10U) /*!< GPIO pin mask */

/* GPIO_LPSR_11 (coord T5), SPI_CS_SEL1 */
/* Routed pin properties */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_PERIPHERAL  GPIO12   /*!< Peripheral name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_SIGNAL     gpio_io   /*!< Signal name */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_CHANNEL        11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_GPIO        GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_GPIO_PIN       11U   /*!< GPIO pin number */
#define BOARD_INITPOWERSTAGESPISPINS_SPI_CS_SEL1_I2C6_SCL_SWO_GPIO_PIN_MASK (1U << 11U) /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPowerStageSPIsPins(void);      /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B1_02 (coord D11), ENET_QOS_RX0 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX0_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX0_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B1_03 (coord E11), ENET_QOS_RX1 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX1_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX1_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX1_CHANNEL                          1U   /*!< Signal channel */

/* GPIO_DISP_B1_04 (coord E10), ENET_QOS_RX2 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX2_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX2_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX2_CHANNEL                          2U   /*!< Signal channel */

/* GPIO_DISP_B1_05 (coord C11), ENET_QOS_RX3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX3_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX3_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX3_CHANNEL                          3U   /*!< Signal channel */

/* GPIO_DISP_B1_09 (coord C13), ENET_QOS_TX0 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX0_BOOT_CFG3_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX0_BOOT_CFG3_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX0_BOOT_CFG3_CHANNEL                0U   /*!< Signal channel */

/* GPIO_DISP_B1_08 (coord A15), ENET_QOS_TX1 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX1_BOOT_CFG2_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX1_BOOT_CFG2_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX1_BOOT_CFG2_CHANNEL                1U   /*!< Signal channel */

/* GPIO_DISP_B1_07 (coord E12), ENET_QOS_TX2 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX2_BOOT_CFG1_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX2_BOOT_CFG1_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX2_BOOT_CFG1_CHANNEL                2U   /*!< Signal channel */

/* GPIO_DISP_B1_06 (coord D10), ENET_QOS_TX3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX3_BOOT_CFG0_PERIPHERAL       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX3_BOOT_CFG0_SIGNAL         enet_tdata   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX3_BOOT_CFG0_CHANNEL                3U   /*!< Signal channel */

