nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* GPIO_DISP_B1_11 (coord A14), ENET_QOS_TX_CLK */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_CLK_BOOT_CFG5_PERIPHERAL    ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_CLK_BOOT_CFG5_SIGNAL     enet_tx_clk   /*!< Signal name */

/* GPIO_DISP_B1_01 (coord D13), ENET_QOS_RX_CLK */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_CLK_PERIPHERAL              ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_CLK_SIGNAL               enet_rx_clk   /*!< Signal name */

/* GPIO_DISP_B1_00 (coord E13), ENET_QOS_RX_EN */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_EN_PERIPHERAL               ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_RX_EN_SIGNAL                 enet_rx_en   /*!< Signal name */

/* GPIO_DISP_B1_10 (coord B14), ENET_QOS_TX_EN */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_EN_BOOT_CFG4_PERIPHERAL     ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_TX_EN_BOOT_CFG4_SIGNAL       enet_tx_en   /*!< Signal name */

/* GPIO_EMC_B2_19 (coord U2), ENET_QOS_MDC_3V3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDC_3V3_PERIPHERAL             ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDC_3V3_SIGNAL                 enet_mdc   /*!< Signal name */

/* GPIO_EMC_B2_20 (coord R3), ENET_QOS_MDIO_3V3 */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDIO_3V3_PERIPHERAL            ENET_QOS   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_MDIO_3V3_SIGNAL               enet_mdio   /*!< Signal name */

/* GPIO_EMC_B2_18 (coord N3), ENET_QOS_PHY_INTB */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_INTB_PERIPHERAL               GPIO2   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_INTB_SIGNAL             gpio_mux_io   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_INTB_CHANNEL                    28U   /*!< Signal channel */

/* GPIO_LPSR_12 (coord U5), ENET_QOS_PHY_RST_B */
/* Routed pin properties */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_RST_B_PERIPHERAL              GPIO6   /*!< Peripheral name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_RST_B_SIGNAL            gpio_mux_io   /*!< Signal name */
#define BOARD_INITTSNENET1GPINS_ENET_QOS_PHY_RST_B_CHANNEL                   12U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTsnEnet1GPins(void);           /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_14 (coord T6), SWD_CLK */
/* Routed pin properties */
#define BOARD_INITDEBUGPINS_SWD_CLK_JTAG_CLK_PERIPHERAL                     JTAG   /*!< Peripheral name */
#define BOARD_INITDEBUGPINS_SWD_CLK_JTAG_CLK_SIGNAL                          TCK   /*!< Signal name */

/* GPIO_LPSR_15 (coord U7), SWD_IO */
/* Routed pin properties */
#define BOARD_INITDEBUGPINS_SWD_DIO_JTAG_TMS_PERIPHERAL                     JTAG   /*!< Peripheral name */
#define BOARD_INITDEBUGPINS_SWD_DIO_JTAG_TMS_SIGNAL                          TMS   /*!< Signal name */

/* GPIO_LPSR_13 (coord U6), JTAG_MOD */
/* Routed pin properties */
#define BOARD_INITDEBUGPINS_JTAG_MOD_PERIPHERAL                             JTAG   /*!< Peripheral name */
#define BOARD_INITDEBUGPINS_JTAG_MOD_SIGNAL                                  MOD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDebugPins(void);               /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B1_05 (coord A16), SD1_D3 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D3_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D3_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D3_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_SD_B1_04 (coord B15), SD1_D2 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D2_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D2_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord B17), SD1_D1 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D1_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D1_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_SD_B1_02 (coord C15), SD1_D0 */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_D0_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_D0_SIGNAL                                usdhc_data   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_D0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_SD_B1_01 (coord D15), SD1_CLK */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_CLK_PERIPHERAL                               USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_CLK_SIGNAL                                usdhc_clk   /*!< Signal name */

/* GPIO_SD_B1_00 (coord B16), SD1_CMD */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_CMD_PERIPHERAL                               USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_CMD_SIGNAL                                usdhc_cmd   /*!< Signal name */

/* GPIO_AD_32 (coord K16), SD1_CD_B */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_CD_B_PERIPHERAL                           CM7_GPIO3   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_CD_B_SIGNAL                         gpio_mux_io_cm7   /*!< Signal name */
#define BOARD_INITSDPINS_SD1_CD_B_CHANNEL                                    31U   /*!< Signal channel */

/* GPIO_AD_34 (coord J16), SD1_VSELECT */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD1_VSELECT_PERIPHERAL                           USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD1_VSELECT_SIGNAL                        usdhc_vselect   /*!< Signal name */

/* GPIO_AD_35 (coord G17), SD_PWREN_B */
/* Routed pin properties */
#define BOARD_INITSDPINS_SD_PWREN_B_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITSDPINS_SD_PWREN_B_SIGNAL                         usdhc_reset_b   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSdPins(void);                  /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_08 (coord F15), FLEXSPI1_A_D0 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D0_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D0_SIGNAL           FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B2_09 (coord H15), FLEXSPI1_A_D1 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D1_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D1_SIGNAL           FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B2_10 (coord H14), FLEXSPI1_A_D2 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D2_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D2_SIGNAL           FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B2_11 (coord F16), FLEXSPI1_A_D3 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D3_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_D3_SIGNAL           FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B2_05 (coord E14), FLEXSPI1_A_DQS */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_DQS_PERIPHERAL             FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_DQS_SIGNAL            FLEXSPI_A_DQS   /*!< Signal name */

