nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* GPIO_SD_B2_07 (coord G14), FLEXSPI1_A_CLK */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_CLK_PERIPHERAL             FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_CLK_SIGNAL           FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B2_03 (coord E15), FLEXSPI1_B_D0 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D0_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D0_SIGNAL           FLEXSPI_B_DATA0   /*!< Signal name */

/* GPIO_SD_B2_02 (coord H13), FLEXSPI1_B_D1 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D1_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D1_SIGNAL           FLEXSPI_B_DATA1   /*!< Signal name */

/* GPIO_SD_B2_01 (coord J14), FLEXSPI1_B_D2 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D2_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D2_SIGNAL           FLEXSPI_B_DATA2   /*!< Signal name */

/* GPIO_SD_B2_00 (coord J15), FLEXSPI1_B_D3 */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D3_PERIPHERAL              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_B_D3_SIGNAL           FLEXSPI_B_DATA3   /*!< Signal name */

/* GPIO_SD_B2_04 (coord F14), FLEXSPI1_A_SS1_B_B_CLK */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_SS1_B_B_CLK_PERIPHERAL     FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_SS1_B_B_CLK_SIGNAL  FLEXSPI_A_SS1_B   /*!< Signal name */

/* GPIO_SD_B2_06 (coord F17), FLEXSPI1_A_SS0_B */
/* Routed pin properties */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_SS0_B_PERIPHERAL           FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITLOGFLEXSPI1PINS_FLEXSPI1_A_SS0_B_SIGNAL        FLEXSPI_A_SS0_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLogFlexSPI1Pins(void);         /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B2_10 (coord R2), FLEXSPI2_A_SCK */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_SCK_PERIPHERAL             FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_SCK_SIGNAL           FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_EMC_B2_11 (coord L4), FLEXSPI2_A_SS_B */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_SS_B_PERIPHERAL            FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_SS_B_SIGNAL         FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_EMC_B2_13 (coord K5), FLEXSPI2_A_D0 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D0_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D0_SIGNAL           FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_EMC_B2_14 (coord M4), FLEXSPI2_A_D1 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D1_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D1_SIGNAL           FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_EMC_B2_15 (coord L2), FLEXSPI2_A_D2 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D2_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D2_SIGNAL           FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_EMC_B2_16 (coord P2), FLEXSPI2_A_D3 */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D3_PERIPHERAL              FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_D3_SIGNAL           FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_EMC_B2_12 (coord M2), FLEXSPI2_A_DQS */
/* Routed pin properties */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_DQS_PERIPHERAL             FLEXSPI2   /*!< Peripheral name */
#define BOARD_INITXIPFLEXSPI2PINS_FLEXSPI2_A_DQS_SIGNAL            FLEXSPI_A_DQS   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXipFlexSPI2Pins(void);         /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSdpUart1Pins(void);            /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_40 (coord K1), LPUART6_TX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_TX_CCM_CLKO1_PERIPHERAL         LPUART6   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_TX_CCM_CLKO1_SIGNAL                 TXD   /*!< Signal name */

/* GPIO_EMC_B1_41 (coord L1), LPUART6_RX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_RX_CCM_CLKO2_PERIPHERAL         LPUART6   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART6_RX_CCM_CLKO2_SIGNAL                 RXD   /*!< Signal name */

/* GPIO_DISP_B2_08 (coord B5), LPUART8_TX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_TX_PERIPHERAL                   LPUART8   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_TX_SIGNAL                           TXD   /*!< Signal name */

/* GPIO_DISP_B2_09 (coord D8), LPUART8_RX */
/* Routed pin properties */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_RX_PERIPHERAL                   LPUART8   /*!< Peripheral name */
#define BOARD_INITDEBUGUARTSPINS_LPUART8_RX_SIGNAL                           RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDebugUartsPins(void);          /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_12 (coord B6), SECURE_CAN1_TX */
/* Routed pin properties */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_TX_PERIPHERAL                  CAN1   /*!< Peripheral name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_TX_SIGNAL                        TX   /*!< Signal name */

/* GPIO_DISP_B2_13 (coord A5), SECURE_CAN1_RX */
/* Routed pin properties */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_RX_PERIPHERAL                  CAN1   /*!< Peripheral name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_RX_SIGNAL                        RX   /*!< Signal name */

/* GPIO_DISP_B2_14 (coord A7), SECURE_CAN1_STBY */
/* Routed pin properties */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_PERIPHERAL              GPIO11   /*!< Peripheral name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_SIGNAL                 gpio_io   /*!< Signal name */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_CHANNEL                    15U   /*!< Signal channel */

