nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_GPIO                    GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_GPIO_PIN                   15U   /*!< GPIO pin number */
#define BOARD_INITSECURECAN1PINS_SECURE_CAN1_STBY_GPIO_PIN_MASK      (1U << 15U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSecureCan1Pins(void);          /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_00 (coord N6), CAN3_TX */
/* Routed pin properties */
#define BOARD_INITCANSPINS_CAN3_TX_PERIPHERAL                               CAN3   /*!< Peripheral name */
#define BOARD_INITCANSPINS_CAN3_TX_SIGNAL                                     TX   /*!< Signal name */

/* GPIO_LPSR_01 (coord R6), CAN3_RX */
/* Routed pin properties */
#define BOARD_INITCANSPINS_CAN3_RX_PERIPHERAL                               CAN3   /*!< Peripheral name */
#define BOARD_INITCANSPINS_CAN3_RX_SIGNAL                                     RX   /*!< Signal name */

/* GPIO_LPSR_02 (coord P6), CAN3_STBY */
/* Routed pin properties */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_PERIPHERAL                GPIO12   /*!< Peripheral name */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_SIGNAL                   gpio_io   /*!< Signal name */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_CHANNEL                       2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_GPIO                      GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_GPIO_PIN                      2U   /*!< GPIO pin number */
#define BOARD_INITCANSPINS_CAN3_STBY_BOOT_MODE0_GPIO_PIN_MASK         (1U << 2U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCansPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_AD_00 (coord N12), RS485_RXD */
/* Routed pin properties */
#define BOARD_INITRS485PINS_RS485_RXD_PERIPHERAL                         LPUART7   /*!< Peripheral name */
#define BOARD_INITRS485PINS_RS485_RXD_SIGNAL                                 TXD   /*!< Signal name */

/* GPIO_AD_01 (coord R14), RS485_TXD */
/* Routed pin properties */
#define BOARD_INITRS485PINS_RS485_TXD_PERIPHERAL                         LPUART7   /*!< Peripheral name */
#define BOARD_INITRS485PINS_RS485_TXD_SIGNAL                                 RXD   /*!< Signal name */

/* GPIO_AD_03 (coord P15), RS485_DE */
/* Routed pin properties */
#define BOARD_INITRS485PINS_RS485_DE_PERIPHERAL                          LPUART7   /*!< Peripheral name */
#define BOARD_INITRS485PINS_RS485_DE_SIGNAL                                RTS_B   /*!< Signal name */

/* GPIO_AD_02 (coord R13), RS485_RE */
/* Routed pin properties */
#define BOARD_INITRS485PINS_RS485_RE_PERIPHERAL                          LPUART7   /*!< Peripheral name */
#define BOARD_INITRS485PINS_RS485_RE_SIGNAL                                CTS_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRs485Pins(void);               /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexioPins(void);              /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_06 (coord P8), USER_BUTTON1 */
/* Routed pin properties */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON1_PERIPHERAL                  GPIO6   /*!< Peripheral name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON1_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON1_CHANNEL                        6U   /*!< Signal channel */

/* GPIO_LPSR_07 (coord R8), USER_BUTTON2 */
/* Routed pin properties */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON2_PERIPHERAL                  GPIO6   /*!< Peripheral name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON2_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON2_CHANNEL                        7U   /*!< Signal channel */

/* GPIO_LPSR_08 (coord U8), USER_BUTTON3 */
/* Routed pin properties */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON3_PERIPHERAL                  GPIO6   /*!< Peripheral name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON3_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON3_CHANNEL                        8U   /*!< Signal channel */

/* GPIO_LPSR_09 (coord P5), USER_BUTTON4 */
/* Routed pin properties */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON4_PERIPHERAL                  GPIO6   /*!< Peripheral name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON4_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERBUTTONSPINS_USER_BUTTON4_CHANNEL                        9U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUserButtonsPins(void);         /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_04 (coord C7), USER_LED1 */
/* Routed pin properties */
#define BOARD_INITUSERLEDSPINS_USER_LED1_BOOT_CFG10_PERIPHERAL             GPIO5   /*!< Peripheral name */
#define BOARD_INITUSERLEDSPINS_USER_LED1_BOOT_CFG10_SIGNAL           gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERLEDSPINS_USER_LED1_BOOT_CFG10_CHANNEL                   5U   /*!< Signal channel */

/* GPIO_DISP_B2_05 (coord C9), USER_LED2 */
/* Routed pin properties */
#define BOARD_INITUSERLEDSPINS_USER_LED2_BOOT_CFG11_PERIPHERAL             GPIO5   /*!< Peripheral name */
#define BOARD_INITUSERLEDSPINS_USER_LED2_BOOT_CFG11_SIGNAL           gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERLEDSPINS_USER_LED2_BOOT_CFG11_CHANNEL                   6U   /*!< Signal channel */

/* GPIO_DISP_B2_06 (coord C6), USER_LED3 */
/* Routed pin properties */
#define BOARD_INITUSERLEDSPINS_USER_LED3_PERIPHERAL                        GPIO5   /*!< Peripheral name */
#define BOARD_INITUSERLEDSPINS_USER_LED3_SIGNAL                      gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERLEDSPINS_USER_LED3_CHANNEL                              7U   /*!< Signal channel */

/* GPIO_DISP_B2_07 (coord D6), USER_LED4 */
/* Routed pin properties */
#define BOARD_INITUSERLEDSPINS_USER_LED4_PERIPHERAL                        GPIO5   /*!< Peripheral name */
#define BOARD_INITUSERLEDSPINS_USER_LED4_SIGNAL                      gpio_mux_io   /*!< Signal name */
#define BOARD_INITUSERLEDSPINS_USER_LED4_CHANNEL                              8U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUserLedsPins(void);            /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_03 (coord T7), SECURITY_RST */
/* Routed pin properties */
#define BOARD_INITSECUREELEMENTPINS_SECURITY_RST_BOOT_MODE1_PERIPHERAL     GPIO6   /*!< Peripheral name */
#define BOARD_INITSECUREELEMENTPINS_SECURITY_RST_BOOT_MODE1_SIGNAL   gpio_mux_io   /*!< Signal name */
#define BOARD_INITSECUREELEMENTPINS_SECURITY_RST_BOOT_MODE1_CHANNEL           3U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSecureElementPins(void);       /* Function assigned for the Cortex-M7F */

