nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/board/pin_mux.h
/* GPIO_DISP_B2_10 (coord D9), I2C3_SCL */
/* Routed pin properties */
#define BOARD_INITI2CPINS_I2C3_SCL_PERIPHERAL                             LPI2C3   /*!< Peripheral name */
#define BOARD_INITI2CPINS_I2C3_SCL_SIGNAL                                    SCL   /*!< Signal name */

/* GPIO_DISP_B2_11 (coord A6), I2C3_SDA */
/* Routed pin properties */
#define BOARD_INITI2CPINS_I2C3_SDA_PERIPHERAL                             LPI2C3   /*!< Peripheral name */
#define BOARD_INITI2CPINS_I2C3_SDA_SIGNAL                                    SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2cPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_00 (coord E8), DIG_OUT_0 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_0_BOOT_CFG6_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_0_BOOT_CFG6_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_0_BOOT_CFG6_CHANNEL               1U   /*!< Signal channel */

/* GPIO_DISP_B2_01 (coord F8), DIG_OUT_1 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_1_BOOT_CFG7_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_1_BOOT_CFG7_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_1_BOOT_CFG7_CHANNEL               2U   /*!< Signal channel */

/* GPIO_DISP_B2_02 (coord E9), DIG_OUT_2 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_2_BOOT_CFG8_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_2_BOOT_CFG8_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_2_BOOT_CFG8_CHANNEL               3U   /*!< Signal channel */

/* GPIO_DISP_B2_03 (coord D7), DIG_OUT_3 */
/* Routed pin properties */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_3_BOOT_CFG9_PERIPHERAL         GPIO5   /*!< Peripheral name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_3_BOOT_CFG9_SIGNAL       gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALOUTPUTPINS_DIG_OUT_3_BOOT_CFG9_CHANNEL               4U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDigitalOutputPins(void);       /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_38 (coord J1), DIG_INPUT_0 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_0_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_0_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_0_CHANNEL                        6U   /*!< Signal channel */

/* GPIO_EMC_B1_39 (coord J2), DIG_INPUT_1 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_1_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_1_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_1_CHANNEL                        7U   /*!< Signal channel */

/* GPIO_EMC_B2_17 (coord T2), DIG_INPUT_2 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_2_PERIPHERAL                  GPIO2   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_2_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_2_CHANNEL                       27U   /*!< Signal channel */

/* GPIO_AD_33 (coord H17), DIG_INPUT_3 */
/* Routed pin properties */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_3_PERIPHERAL                  GPIO4   /*!< Peripheral name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_3_SIGNAL                gpio_mux_io   /*!< Signal name */
#define BOARD_INITDIGITALINPUTPINS_DIG_INPUT_3_CHANNEL                        0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDigitalInputPins(void);        /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_15 (coord A4), WDOG_B */
/* Routed pin properties */
#define BOARD_INITWDOGPINS_WDOG_B_PERIPHERAL                               WDOG1   /*!< Peripheral name */
#define BOARD_INITWDOGPINS_WDOG_B_SIGNAL                             wdog_wdog_b   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWdogPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_40 (coord K1), LPUART6_TX */
/* Routed pin properties */
#define BOARD_INITCLOCKOUTPUTPINS_LPUART6_TX_CCM_CLKO1_PERIPHERAL            CCM   /*!< Peripheral name */
#define BOARD_INITCLOCKOUTPUTPINS_LPUART6_TX_CCM_CLKO1_SIGNAL              CLKO1   /*!< Signal name */

/* GPIO_EMC_B1_41 (coord L1), LPUART6_RX */
/* Routed pin properties */
#define BOARD_INITCLOCKOUTPUTPINS_LPUART6_RX_CCM_CLKO2_PERIPHERAL            CCM   /*!< Peripheral name */
#define BOARD_INITCLOCKOUTPUTPINS_LPUART6_RX_CCM_CLKO2_SIGNAL              CLKO2   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitClockOutputPins(void);         /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MC_InitXbar(void);                       /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
